{
  "version": "https://jsonfeed.org/version/1",
  "title": "Codes are a puzzle",
  "home_page_url": "https://iqnev.github.io/",
  "feed_url": "https://iqnev.github.io/feed.json",
  "description": "A minimal hugo theme focus on content",
  "favicon": "https://iqnev.github.io//assets/favicon.ico",
  "expired": false,
  "author": {
    "name": "Calvin Tran",
    "url": "https://iqnev.github.io/"
  },
  "items": [
    
    

    
    {
      "id": "d8121afede58861489c854fcdd26839c8a105ec6",
      "title": "Extending Quarkus: When and How to Write Your Own Extensions",
      "summary": "",
      "content_text": "Quarkus, with its innovative extension framework, offers developers a powerful way to integrate various technologies seamlessly into their applications. These extensions simplify configuration, enable dependency injection, and optimize performance, making it an attractive option for Java developers. However, before diving into creating your own Quarkus extension, it\u0026rsquo;s crucial to understand when it\u0026rsquo;s necessary and how to do it effectively.\nWhen to Create a Quarkus Extension Complex Integrations: If you\u0026rsquo;re working with complex frameworks like ORM mappers, reactive clients, or data access libraries, creating an extension can help manage the intricacies of configuration and dependency management. Extensions simplify the use of these frameworks in Quarkus applications.\nPerformance Optimization: Quarkus extensions are designed to align with Quarkus\u0026rsquo; native compilation, resulting in applications that start swiftly and have minimal memory footprints. By creating an extension, you can leverage Quarkus\u0026rsquo; build-time optimization abilities to scan dependencies and generate configuration early, thus avoiding startup delays.\nDeveloper Experience Enhancement: Extensions can significantly enhance the developer experience. They enable live reloading, CLI extensions, templating, and more, streamlining the development process. If you want to provide a seamless and efficient development environment for your team, extensions can help achieve this goal.\nAPI Hardening: If you\u0026rsquo;re building APIs or libraries intended to be used by other Quarkus developers, extensions provide an excellent way to harden your APIs and ensure they work seamlessly within the Quarkus ecosystem.\nHowever, extensions may not always be the best approach. For simpler needs, such as sharing utility code and glue logic between components, a basic JAR file might suffice without the overhead of creating an extension. If your integration is app-specific and unlikely to be reused elsewhere, a basic JAR could be a more straightforward solution. Moreover, if you need full control over dependency versions and don\u0026rsquo;t want to adhere to Quarkus\u0026rsquo; BOM (Bill of Materials) for dependency management, a JAR may be a better choice. Finally, if your code needs to work across multiple JVM frameworks, such as Spring and Micronaut, avoiding tight coupling to Quarkus may be preferable.\nCreating Quarkus extensions can be complex, often requiring in-depth knowledge of Quarkus internal workings. However, for many scenarios, creating a standard JAR can be sufficient. This JAR, when indexed by Jandex, can be seamlessly discovered by Quarkus during build time. While Quarkus extensions provide a range of advantages, including superior performance and developer productivity, they may not always be necessary.\nQuarkus unique approach to moving work to build time, rather than runtime, is at the core of its fast startup times and low memory footprint. This philosophy extends to Quarkus extensions, which can leverage these build-time optimizations. Even if you\u0026rsquo;re not primarily concerned with fast boot times, the benefits of creating your extensions extend to simplifying configurations, extending the Quarkus CLI, and integrating with Quarkus\u0026rsquo;s Dev Mode.\nCreating your Quarkus extensions doesn\u0026rsquo;t have to be overly complicated. With the right approach and a clear understanding of your project\u0026rsquo;s needs, you can solve complex problems efficiently. Extensions offer a flexible and powerful way to enhance your Quarkus applications and make them more efficient and developer-friendly.\nCreating a Quarkus Extension When you decide that creating a Quarkus extension is the right approach, it\u0026rsquo;s essential to understand the structural components of an extension:\nRuntime Section: This section contains the core business logic implemented as beans, services, or other components that integrate with Quarkus; Deployment Section: The deployment section handles build-time augmentation and configuration. It ensures that your extension integrates seamlessly with Quarkus\u0026rsquo; optimization processes; Descriptor: A descriptor declares metadata about your extension, including its name, parameters, compatibility information, and more; Documentation: Comprehensive documentation should accompany your extension. It guides users on how to use and configure your extension effectively. Anatomy of the Quarkus Extension Consider a scenario where you want to create a custom caching extension for Quarkus. This extension will allow developers to easily integrate caching functionality into their Quarkus applications.\nRuntime Section:\nIn this section, you would implement the core caching functionality using Java code. This might include methods for caching data, retrieving cached data, and managing cache expiration. For example, you might have a CustomCacheService class with methods like put(key, value), get(key), and evict(key) to handle caching operations. Deployment Section:\nThe deployment section is responsible for build-time optimization. Here, you can specify how the caching configuration should be generated during the build process. For our caching extension, this section might include instructions on how to scan for cached objects in the application code and generate cache configuration. Descriptor:\nThe descriptor file (custom-cache-extension.yaml) provides metadata about your extension. It includes information like the extension\u0026rsquo;s name, version, compatibility with Quarkus, and configuration parameters. For instance, your descriptor might specify that the extension is named \u0026ldquo;custom-cache-extension,\u0026rdquo; is compatible with Quarkus 2.0+, and requires a cache timeout configuration parameter. Documentation:\nComprehensive documentation should accompany your extension. It guides users on how to use the custom caching extension effectively within their Quarkus applications. Documentation should include examples of how to configure the cache, integrate it into Quarkus services, and manage cached data. Additionally, it should provide best practices for cache utilization. By following this structure, your custom caching extension becomes a valuable tool for Quarkus developers. They can easily incorporate caching into their applications, improving performance and optimizing resource usage.\nRuntime module:\nclass CustomCacheService { // Core caching functionality using Java code public void put(String key, Object value) { // Cache data implementation } public Object get(String key) { // Retrieve cached data implementation } public void evict(String key) { // Evict cached data implementation } } Deployment module:\nclass CustomCacheProcessor { @BuildStep FeatureBuildItem feature() { // This declares the custom cache extension as a feature return new FeatureBuildItem(\u0026#34;custom-cache\u0026#34;); } } Descriptor file: custom-cache-extension.yaml\nextension: name: custom-cache-extension metadata: short-name: \u0026#34;resteasy-reactive\u0026#34; keywords: - \u0026#34;jaxrs\u0026#34; - \u0026#34;web\u0026#34; - \u0026#34;rest\u0026#34; categories: - \u0026#34;web\u0026#34; - \u0026#34;reactive\u0026#34; status: \u0026#34;stable\u0026#34; guide: \u0026#34;https://quarkus.io/guides/resteasy-reactive\u0026#34; In conclusion, whether to create a Quarkus extension depends on your project\u0026rsquo;s specific needs and objectives. Quarkus extensions are powerful tools for deep integration, performance optimization, and enhancing the developer experience. However, it\u0026rsquo;s essential to weigh the trade-offs and consider whether a simpler solution, like a standard JAR library, might better suit your use case. By understanding when and how to create Quarkus extensions effectively, you can make informed decisions and leverage the full potential of this innovative framework.\n",
      "content_html": "\u003cp\u003eQuarkus, with its innovative extension framework, offers developers a powerful way to integrate various technologies seamlessly into their applications.\nThese extensions simplify configuration, enable dependency injection, and optimize performance, making it an attractive option for Java developers.\nHowever, before diving into creating your own Quarkus extension, it\u0026rsquo;s crucial to understand when it\u0026rsquo;s necessary and how to do it effectively.\u003c/p\u003e\n\u003ch2 id=\"when-to-create-a-quarkus-extension\"\u003eWhen to Create a Quarkus Extension\u003c/h2\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eComplex Integrations: If you\u0026rsquo;re working with complex frameworks like ORM mappers, reactive clients, or data access libraries, creating an extension can help manage the intricacies of configuration and dependency management.\nExtensions simplify the use of these frameworks in Quarkus applications.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePerformance Optimization: Quarkus extensions are designed to align with Quarkus\u0026rsquo; native compilation, resulting in applications that start swiftly and have minimal memory footprints.\nBy creating an extension, you can leverage Quarkus\u0026rsquo; build-time optimization abilities to scan dependencies and generate configuration early, thus avoiding startup delays.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDeveloper Experience Enhancement: Extensions can significantly enhance the developer experience.\nThey enable live reloading, CLI extensions, templating, and more, streamlining the development process.\nIf you want to provide a seamless and efficient development environment for your team, extensions can help achieve this goal.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAPI Hardening: If you\u0026rsquo;re building APIs or libraries intended to be used by other Quarkus developers, extensions provide an excellent way to harden your\nAPIs and ensure they work seamlessly within the Quarkus ecosystem.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eHowever, extensions may not always be the best approach. For simpler needs, such as sharing utility code and glue logic between components, a basic JAR file might\nsuffice without the overhead of creating an extension. If your integration is app-specific and unlikely to be reused elsewhere, a basic JAR could be a more straightforward solution. Moreover, if you need full control over dependency versions and don\u0026rsquo;t want to adhere to Quarkus\u0026rsquo; BOM (Bill of Materials) for dependency management, a JAR may be a better choice. Finally, if your code needs to work across multiple JVM frameworks, such as Spring and Micronaut,\navoiding tight coupling to Quarkus may be preferable.\u003c/p\u003e\n\u003cp\u003eCreating Quarkus extensions can be complex, often requiring in-depth knowledge of Quarkus internal workings. However, for many scenarios, creating a standard JAR can be sufficient. This JAR, when indexed by Jandex, can be seamlessly discovered by Quarkus during build time. While Quarkus extensions provide a range of advantages, including superior performance and developer productivity, they may not always be necessary.\u003c/p\u003e\n\u003cp\u003eQuarkus unique approach to moving work to build time, rather than runtime, is at the core of its fast startup times and low memory footprint. This philosophy extends to Quarkus extensions, which can leverage these build-time optimizations. Even if you\u0026rsquo;re not primarily concerned with fast boot times, the benefits of creating your extensions extend to simplifying configurations, extending the Quarkus CLI, and integrating with Quarkus\u0026rsquo;s Dev Mode.\u003c/p\u003e\n\u003cp\u003eCreating your Quarkus extensions doesn\u0026rsquo;t have to be overly complicated. With the right approach and a clear understanding of your project\u0026rsquo;s needs, you can solve complex problems efficiently. Extensions offer a flexible and powerful way to enhance your Quarkus applications and make them more efficient and developer-friendly.\u003c/p\u003e\n\u003ch2 id=\"creating-a-quarkus-extension\"\u003eCreating a Quarkus Extension\u003c/h2\u003e\n\u003cp\u003eWhen you decide that creating a Quarkus extension is the right approach, it\u0026rsquo;s essential to understand the structural components of an extension:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eRuntime Section:\u003c/strong\u003e This section contains the core business logic implemented as beans, services, or other components that integrate with Quarkus;\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDeployment Section:\u003c/strong\u003e The deployment section handles build-time augmentation and configuration. It ensures that your extension integrates seamlessly with Quarkus\u0026rsquo; optimization processes;\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDescriptor:\u003c/strong\u003e A descriptor declares metadata about your extension, including its name, parameters, compatibility information, and more;\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDocumentation:\u003c/strong\u003e Comprehensive documentation should accompany your extension. It guides users on how to use and configure your extension effectively.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2 id=\"anatomy-of-the-quarkus-extension\"\u003eAnatomy of the Quarkus Extension\u003c/h2\u003e\n\u003cp\u003eConsider a scenario where you want to create a custom caching extension for Quarkus. This extension will allow developers to easily integrate caching functionality into their Quarkus applications.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eRuntime Section:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIn this section, you would implement the core caching functionality using Java code. This might include methods for caching data, retrieving cached data, and managing cache expiration.\u003c/li\u003e\n\u003cli\u003eFor example, you might have a \u003ccode\u003eCustomCacheService\u003c/code\u003e class with methods like \u003ccode\u003eput(key, value)\u003c/code\u003e, \u003ccode\u003eget(key)\u003c/code\u003e, and \u003ccode\u003eevict(key)\u003c/code\u003e to handle caching operations.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eDeployment Section:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe deployment section is responsible for build-time optimization. Here, you can specify how the caching configuration should be generated during the build process.\u003c/li\u003e\n\u003cli\u003eFor our caching extension, this section might include instructions on how to scan for cached objects in the application code and generate cache configuration.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eDescriptor:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe descriptor file (\u003ccode\u003ecustom-cache-extension.yaml\u003c/code\u003e) provides metadata about your extension. It includes information like the extension\u0026rsquo;s name, version, compatibility with Quarkus, and configuration parameters.\u003c/li\u003e\n\u003cli\u003eFor instance, your descriptor might specify that the extension is named \u0026ldquo;custom-cache-extension,\u0026rdquo; is compatible with Quarkus 2.0+, and requires a cache timeout configuration parameter.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eDocumentation:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComprehensive documentation should accompany your extension. It guides users on how to use the custom caching extension effectively within their Quarkus applications.\u003c/li\u003e\n\u003cli\u003eDocumentation should include examples of how to configure the cache, integrate it into Quarkus services, and manage cached data. Additionally, it should provide best practices for cache utilization.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eBy following this structure, your custom caching extension becomes a valuable tool for Quarkus developers. They can easily incorporate caching into their applications, improving performance and optimizing resource usage.\u003c/p\u003e\n\u003cp\u003eRuntime module:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"color:#272822;background-color:#fafafa;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-java\" data-lang=\"java\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#00a8c8\"\u003eclass\u003c/span\u003e \u003cspan style=\"color:#75af00\"\u003eCustomCacheService\u003c/span\u003e \u003cspan style=\"color:#f92672\"\u003e{\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e  \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#75715e\"\u003e// Core caching functionality using Java code\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#75715e\"\u003e\u003c/span\u003e    \u003cspan style=\"color:#00a8c8\"\u003epublic\u003c/span\u003e \u003cspan style=\"color:#00a8c8\"\u003evoid\u003c/span\u003e \u003cspan style=\"color:#75af00\"\u003eput\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e(\u003c/span\u003e\u003cspan style=\"color:#111\"\u003eString\u003c/span\u003e \u003cspan style=\"color:#111\"\u003ekey\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e,\u003c/span\u003e \u003cspan style=\"color:#111\"\u003eObject\u003c/span\u003e \u003cspan style=\"color:#111\"\u003evalue\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e)\u003c/span\u003e \u003cspan style=\"color:#f92672\"\u003e{\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      \u003cspan style=\"color:#75715e\"\u003e// Cache data implementation\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#75715e\"\u003e\u003c/span\u003e    \u003cspan style=\"color:#f92672\"\u003e}\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#00a8c8\"\u003epublic\u003c/span\u003e \u003cspan style=\"color:#111\"\u003eObject\u003c/span\u003e \u003cspan style=\"color:#75af00\"\u003eget\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e(\u003c/span\u003e\u003cspan style=\"color:#111\"\u003eString\u003c/span\u003e \u003cspan style=\"color:#111\"\u003ekey\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e)\u003c/span\u003e \u003cspan style=\"color:#f92672\"\u003e{\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      \u003cspan style=\"color:#75715e\"\u003e// Retrieve cached data implementation\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#75715e\"\u003e\u003c/span\u003e    \u003cspan style=\"color:#f92672\"\u003e}\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#00a8c8\"\u003epublic\u003c/span\u003e \u003cspan style=\"color:#00a8c8\"\u003evoid\u003c/span\u003e \u003cspan style=\"color:#75af00\"\u003eevict\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e(\u003c/span\u003e\u003cspan style=\"color:#111\"\u003eString\u003c/span\u003e \u003cspan style=\"color:#111\"\u003ekey\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e)\u003c/span\u003e \u003cspan style=\"color:#f92672\"\u003e{\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      \u003cspan style=\"color:#75715e\"\u003e// Evict cached data implementation\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#75715e\"\u003e\u003c/span\u003e    \u003cspan style=\"color:#f92672\"\u003e}\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#f92672\"\u003e}\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eDeployment module:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"color:#272822;background-color:#fafafa;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-java\" data-lang=\"java\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#00a8c8\"\u003eclass\u003c/span\u003e \u003cspan style=\"color:#75af00\"\u003eCustomCacheProcessor\u003c/span\u003e \u003cspan style=\"color:#f92672\"\u003e{\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#75af00\"\u003e@BuildStep\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#111\"\u003eFeatureBuildItem\u003c/span\u003e \u003cspan style=\"color:#75af00\"\u003efeature\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e()\u003c/span\u003e \u003cspan style=\"color:#f92672\"\u003e{\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e        \u003cspan style=\"color:#75715e\"\u003e// This declares the custom cache extension as a feature\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#75715e\"\u003e\u003c/span\u003e        \u003cspan style=\"color:#00a8c8\"\u003ereturn\u003c/span\u003e \u003cspan style=\"color:#00a8c8\"\u003enew\u003c/span\u003e \u003cspan style=\"color:#111\"\u003eFeatureBuildItem\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e(\u003c/span\u003e\u003cspan style=\"color:#d88200\"\u003e\u0026#34;custom-cache\u0026#34;\u003c/span\u003e\u003cspan style=\"color:#f92672\"\u003e);\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#f92672\"\u003e}\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#f92672\"\u003e}\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eDescriptor file: \u003ccode\u003ecustom-cache-extension.yaml\u003c/code\u003e\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"color:#272822;background-color:#fafafa;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-yaml\" data-lang=\"yaml\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#f92672\"\u003eextension\u003c/span\u003e\u003cspan style=\"color:#111\"\u003e:\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#f92672\"\u003ename\u003c/span\u003e\u003cspan style=\"color:#111\"\u003e:\u003c/span\u003e \u003cspan style=\"color:#ae81ff\"\u003ecustom-cache-extension\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#f92672\"\u003emetadata\u003c/span\u003e\u003cspan style=\"color:#111\"\u003e:\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#f92672\"\u003eshort-name\u003c/span\u003e\u003cspan style=\"color:#111\"\u003e:\u003c/span\u003e \u003cspan style=\"color:#d88200\"\u003e\u0026#34;resteasy-reactive\u0026#34;\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#f92672\"\u003ekeywords\u003c/span\u003e\u003cspan style=\"color:#111\"\u003e:\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    - \u003cspan style=\"color:#d88200\"\u003e\u0026#34;jaxrs\u0026#34;\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    - \u003cspan style=\"color:#d88200\"\u003e\u0026#34;web\u0026#34;\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    - \u003cspan style=\"color:#d88200\"\u003e\u0026#34;rest\u0026#34;\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#f92672\"\u003ecategories\u003c/span\u003e\u003cspan style=\"color:#111\"\u003e:\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    - \u003cspan style=\"color:#d88200\"\u003e\u0026#34;web\u0026#34;\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    - \u003cspan style=\"color:#d88200\"\u003e\u0026#34;reactive\u0026#34;\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#f92672\"\u003estatus\u003c/span\u003e\u003cspan style=\"color:#111\"\u003e:\u003c/span\u003e \u003cspan style=\"color:#d88200\"\u003e\u0026#34;stable\u0026#34;\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e    \u003cspan style=\"color:#f92672\"\u003eguide\u003c/span\u003e\u003cspan style=\"color:#111\"\u003e:\u003c/span\u003e \u003cspan style=\"color:#d88200\"\u003e\u0026#34;https://quarkus.io/guides/resteasy-reactive\u0026#34;\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eIn conclusion, whether to create a Quarkus extension depends on your project\u0026rsquo;s specific needs and objectives.\nQuarkus extensions are powerful tools for deep integration, performance optimization, and enhancing the developer experience.\nHowever, it\u0026rsquo;s essential to weigh the trade-offs and consider whether a simpler solution, like a standard JAR library, might better suit your use case.\nBy understanding when and how to create Quarkus extensions effectively, you can make informed decisions and leverage the full potential of this innovative framework.\u003c/p\u003e\n",
      "url": "https://iqnev.github.io/posts/when-and-how-to-write-your-own-extensions/",
      "date_published": "8106-08-09T1029:88:00+03:00",
      "date_modified": "8106-08-09T1029:88:00+03:00",
      "author": {
        "name": "Calvin Tran",
        "url": "https://iqnev.github.io/"
      }
    },
    
    {
      "id": "497df46942fdef9737dcec4d8e5c01833016c78e",
      "title": "Demystifying Quarkus Extension Development: Jandex vs. AdditionalBeanBuildItem",
      "summary": "",
      "content_text": "Welcome to a comprehensive exploration of two key aspects in Quarkus extension development: Jandex and AdditionalBeanBuildItem. This article aims to elucidate the differences between these approaches, offering insights into their roles, applications, and the intricate interplay between them. By the end, you\u0026rsquo;ll have a clear understanding of how to wield these tools effectively in your Quarkus extensions.\n1. Jandex: Automatic Bean Discovery and Indexing Understanding Jandex and Its Role: In the realm of Quarkus extensions, beans are the building blocks of functionality, and Contexts and Dependency Injection (CDI) is the mechanism that governs their management. Jandex, a potent tool in the Quarkus arsenal, facilitates automatic bean discovery and indexing.\nHow Jandex Indexing Works: When the Jandex plugin is integrated into your Quarkus extension, it sweeps through all application classes, creating a comprehensive index file laden with metadata. This file offers an organized snapshot of class metadata, annotations, inheritance hierarchies, and interfaces. It acts as a centralized repository of class information.\nThe Role of Jandex in CDI: However, Jandex\u0026rsquo;s role doesn\u0026rsquo;t extend to direct CDI bean discovery. Instead, it supplies information to the CDI container. During the container\u0026rsquo;s initiation, it delves into the Jandex index to identify potential beans and the annotations associated with them. This enables the CDI container to curate the beans available for injection and other CDI functionalities.\nExample: Automatic Bean Discovery with Jandex: Imagine creating a custom Quarkus extension. By annotating a class with CDI-specific annotations like @ApplicationScoped, Jandex, via its indexing prowess, effortlessly identifies and makes these classes available for CDI. This harmonious integration streamlines the extension process and ensures precise bean identification.\n2. AdditionalIndexedClassesBuildItem: Explicit Jandex Indexing Understanding AdditionalIndexedClassesBuildItem: In cases where you seek more control over class indexing, the AdditionalIndexedClassesBuildItem emerges as a valuable tool. It empowers you to explicitly augment the Jandex index with classes that might otherwise remain unindexed.\nWhen to Use AdditionalIndexedClassesBuildItem: This tool is particularly useful when classes outside of typical bean discovery need to be indexed for other purposes. These classes might belong to third-party libraries or external tools requiring metadata access. By leveraging AdditionalIndexedClassesBuildItem, you guarantee proper indexing and metadata availability.\nUsage of AdditionalIndexedClassesBuildItem: By providing specific class names to AdditionalIndexedClassesBuildItem\u0026rsquo;s constructor, you precisely dictate which classes receive metadata indexing. Regardless of annotations or interfaces, you exercise control over the indexing process.\nExample: Explicitly Indexing Custom Configuration Classes: Imagine crafting an extension that requires metadata access to configuration classes from diverse sources. These classes may not boast CDI annotations, but their metadata remains vital. Through AdditionalIndexedClassesBuildItem, you secure their inclusion in the Jandex index, ensuring accessible metadata for your extension.\n3. AdditionalBeanBuildItem: Explicit Bean Registration Understanding AdditionalBeanBuildItem: While Jandex handles automatic bean discovery, you might require a more involved approach. This is where AdditionalBeanBuildItem steps in, empowering you to explicitly register classes as CDI beans.\nWhen to Use AdditionalBeanBuildItem: Custom utility classes, third-party libraries, or unconventional beans might necessitate inclusion in the CDI context. By embracing AdditionalBeanBuildItem, you enforce bean treatment irrespective of annotations or auto-discovery.\nUsage of AdditionalBeanBuildItem: Through AdditionalBeanBuildItem, you specify class names to be registered as beans. This flexibility allows you to seamlessly incorporate custom beans essential to your extension\u0026rsquo;s functionality.\nExample: Registering Custom Utility Classes as CDI Beans: Imagine building an extension that furnishes additional error handling utilities. These utilities might lack CDI annotations but require injection capabilities. AdditionalBeanBuildItem facilitates explicit registration of these utilities as CDI beans, amplifying their accessibility.\n4. Combining Approaches: Using Both Jandex and AdditionalBeanBuildItem Advantages of Combining Approaches: Harnessing the strengths of both Jandex and AdditionalBeanBuildItem offers strategic leverage. This hybrid approach strikes a balance between automated discovery and explicit control, granting you the power to cherry-pick beans while enjoying default discovery benefits.\nPotential Issues and Solutions: The synergy between these approaches is powerful, but vigilance is essential to avert duplicate bean registrations. Overlapping registrations between automatic Jandex indexing and explicit AdditionalBeanBuildItem inclusion can lead to conflicts. Careful coordination ensures seamless coexistence.\n5. Native Build Considerations: Impact of Jandex and AdditionalBeanBuildItem Jandex and Native Build: Understand that GraalVM\u0026rsquo;s native build process doesn\u0026rsquo;t engage directly with the Jandex index. Native build concentrates on compiling the Java application into a native binary, leveraging compiled Java classes and dependencies.\nAdditionalBeanBuildItem and Native Build: Similarly, native build isn\u0026rsquo;t heavily impacted by AdditionalBeanBuildItem\u0026rsquo;s presence or absence. Bean registration doesn\u0026rsquo;t significantly alter native build outcomes, which center on compiling and optimizing the application into a native binary.\nConclusion: Navigating Jandex and AdditionalBeanBuildItem\nThrough this journey, the nuances of Jandex and AdditionalBeanBuildItem have been unraveled. Jandex\u0026rsquo;s role in metadata provision and CDI\u0026rsquo;s execution has been clarified, alongside AdditionalBeanBuildItem\u0026rsquo;s explicit bean registration. Remember, Jandex doesn\u0026rsquo;t automatically transform classes into CDI beans; the CDI container is pivotal. Leverage these tools strategically, aligning choices with your extension\u0026rsquo;s demands for seamless integration in Quarkus\u0026rsquo; CDI framework.\n",
      "content_html": "\u003cp\u003eWelcome to a comprehensive exploration of two key aspects in Quarkus extension development: Jandex and AdditionalBeanBuildItem.\nThis article aims to elucidate the differences between these approaches, offering insights into their roles, applications, and the\nintricate interplay between them. By the end, you\u0026rsquo;ll have a clear understanding of how to wield these tools effectively in your Quarkus\nextensions.\u003c/p\u003e\n\u003ch2 id=\"1-jandex-automatic-bean-discovery-and-indexing\"\u003e1. Jandex: Automatic Bean Discovery and Indexing\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eUnderstanding Jandex and Its Role:\u003c/strong\u003e\nIn the realm of Quarkus extensions, beans are the building blocks of functionality, and Contexts and Dependency Injection (CDI) is\nthe mechanism that governs their management. Jandex, a potent tool in the Quarkus arsenal, facilitates automatic bean discovery and indexing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow Jandex Indexing Works:\u003c/strong\u003e\nWhen the Jandex plugin is integrated into your Quarkus extension, it sweeps through all application classes, creating a comprehensive\nindex file laden with metadata. This file offers an organized snapshot of class metadata, annotations, inheritance hierarchies, and\ninterfaces. It acts as a centralized repository of class information.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role of Jandex in CDI:\u003c/strong\u003e\nHowever, Jandex\u0026rsquo;s role doesn\u0026rsquo;t extend to direct CDI bean discovery. Instead, it supplies information to the CDI container. During the container\u0026rsquo;s initiation, it delves into the Jandex index to identify potential beans and the annotations associated with them. This enables the CDI container to curate the beans available for injection and other CDI functionalities.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExample: Automatic Bean Discovery with Jandex:\u003c/strong\u003e\nImagine creating a custom Quarkus extension. By annotating a class with CDI-specific annotations like \u003ccode\u003e@ApplicationScoped\u003c/code\u003e,\nJandex, via its indexing prowess, effortlessly identifies and makes these classes available for CDI. This harmonious integration\nstreamlines the extension process and ensures precise bean identification.\u003c/p\u003e\n\u003ch2 id=\"2-additionalindexedclassesbuilditem-explicit-jandex-indexing\"\u003e2. AdditionalIndexedClassesBuildItem: Explicit Jandex Indexing\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eUnderstanding AdditionalIndexedClassesBuildItem:\u003c/strong\u003e\nIn cases where you seek more control over class indexing, the \u003ccode\u003eAdditionalIndexedClassesBuildItem\u003c/code\u003e emerges as a valuable tool.\nIt empowers you to explicitly augment the Jandex index with classes that might otherwise remain unindexed.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhen to Use AdditionalIndexedClassesBuildItem:\u003c/strong\u003e\nThis tool is particularly useful when classes outside of typical bean discovery need to be indexed for other purposes.\nThese classes might belong to third-party libraries or external tools requiring metadata access.\nBy leveraging \u003ccode\u003eAdditionalIndexedClassesBuildItem\u003c/code\u003e, you guarantee proper indexing and metadata availability.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUsage of AdditionalIndexedClassesBuildItem:\u003c/strong\u003e\nBy providing specific class names to AdditionalIndexedClassesBuildItem\u0026rsquo;s constructor, you precisely dictate which classes receive metadata\nindexing. Regardless of annotations or interfaces, you exercise control over the indexing process.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExample: Explicitly Indexing Custom Configuration Classes:\u003c/strong\u003e\nImagine crafting an extension that requires metadata access to configuration classes from diverse sources.\nThese classes may not boast CDI annotations, but their metadata remains vital.\nThrough \u003ccode\u003eAdditionalIndexedClassesBuildItem\u003c/code\u003e, you secure their inclusion in the Jandex index, ensuring accessible metadata for your extension.\u003c/p\u003e\n\u003ch2 id=\"3-additionalbeanbuilditem-explicit-bean-registration\"\u003e3. AdditionalBeanBuildItem: Explicit Bean Registration\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eUnderstanding AdditionalBeanBuildItem:\u003c/strong\u003e\nWhile Jandex handles automatic bean discovery, you might require a more involved approach. This is where AdditionalBeanBuildItem steps in,\nempowering you to explicitly register classes as CDI beans.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhen to Use AdditionalBeanBuildItem:\u003c/strong\u003e\nCustom utility classes, third-party libraries, or unconventional beans might necessitate inclusion in the CDI context.\nBy embracing \u003ccode\u003eAdditionalBeanBuildItem\u003c/code\u003e, you enforce bean treatment irrespective of annotations or auto-discovery.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUsage of AdditionalBeanBuildItem:\u003c/strong\u003e\nThrough \u003ccode\u003eAdditionalBeanBuildItem\u003c/code\u003e, you specify class names to be registered as beans. This flexibility allows you to\nseamlessly incorporate custom beans essential to your extension\u0026rsquo;s functionality.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExample: Registering Custom Utility Classes as CDI Beans:\u003c/strong\u003e\nImagine building an extension that furnishes additional error handling utilities. These utilities might lack CDI annotations\nbut require injection capabilities. \u003ccode\u003eAdditionalBeanBuildItem\u003c/code\u003e facilitates explicit registration of these utilities as CDI beans,\namplifying their accessibility.\u003c/p\u003e\n\u003ch2 id=\"4-combining-approaches-using-both-jandex-and-additionalbeanbuilditem\"\u003e4. Combining Approaches: Using Both Jandex and AdditionalBeanBuildItem\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eAdvantages of Combining Approaches:\u003c/strong\u003e\nHarnessing the strengths of both Jandex and \u003ccode\u003eAdditionalBeanBuildItem\u003c/code\u003e offers strategic leverage. This hybrid approach strikes a\nbalance between automated discovery and explicit control, granting you the power to cherry-pick beans while enjoying default discovery\nbenefits.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePotential Issues and Solutions:\u003c/strong\u003e\nThe synergy between these approaches is powerful, but vigilance is essential to avert duplicate bean registrations.\nOverlapping registrations between automatic Jandex indexing and explicit \u003ccode\u003eAdditionalBeanBuildItem\u003c/code\u003e inclusion can lead to conflicts.\nCareful coordination ensures seamless coexistence.\u003c/p\u003e\n\u003ch2 id=\"5-native-build-considerations-impact-of-jandex-and-additionalbeanbuilditem\"\u003e5. Native Build Considerations: Impact of Jandex and AdditionalBeanBuildItem\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eJandex and Native Build:\u003c/strong\u003e\nUnderstand that GraalVM\u0026rsquo;s native build process doesn\u0026rsquo;t engage directly with the Jandex index. Native build concentrates on compiling\nthe Java application into a native binary, leveraging compiled Java classes and dependencies.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditionalBeanBuildItem and Native Build:\u003c/strong\u003e\nSimilarly, native build isn\u0026rsquo;t heavily impacted by AdditionalBeanBuildItem\u0026rsquo;s presence or absence. Bean registration doesn\u0026rsquo;t significantly\nalter native build outcomes, which center on compiling and optimizing the application into a native binary.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eConclusion: Navigating Jandex and AdditionalBeanBuildItem\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThrough this journey, the nuances of Jandex and \u003ccode\u003eAdditionalBeanBuildItem\u003c/code\u003e have been unraveled. Jandex\u0026rsquo;s role in metadata provision\nand CDI\u0026rsquo;s execution has been clarified, alongside AdditionalBeanBuildItem\u0026rsquo;s explicit bean registration. Remember, Jandex doesn\u0026rsquo;t\nautomatically transform classes into CDI beans; the CDI container is pivotal. Leverage these tools strategically, aligning\nchoices with your extension\u0026rsquo;s demands for seamless integration in Quarkus\u0026rsquo; CDI framework.\u003c/p\u003e\n",
      "url": "https://iqnev.github.io/posts/jandex-vs-additional-bean-builditem/",
      "date_published": "26096-26-09T94:2626:00+03:00",
      "date_modified": "26096-26-09T94:2626:00+03:00",
      "author": {
        "name": "Calvin Tran",
        "url": "https://iqnev.github.io/"
      }
    }
    
  ]
}